; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 842951 2 3 4 5 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	infrared1 - mode
	image2 - mode
	spectrograph0 - mode
	image3 - mode
	Star2 - direction
	Star3 - direction
	GroundStation1 - direction
	GroundStation0 - direction
	Star4 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Planet7 - direction
	Star8 - direction
	Star9 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 spectrograph0)
	(supports instrument1 infrared1)
	(supports instrument1 image2)
	(calibration_target instrument1 Star4)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument3 image3)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 Star4)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star8)
)
(:goal (and
	(have_image Phenomenon5 infrared1)
	(have_image Planet6 spectrograph0)
	(have_image Planet7 spectrograph0)
	(have_image Star8 infrared1)
	(have_image Star9 image3)
))

)

; plan
1. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 5
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 5
3. (turn_to satellite1 star9 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star9)
   goals met: 0 of 5
4. (turn_to satellite0 star8 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star8)
   goals met: 0 of 5
5. (turn_to satellite1 star4 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star4)
   goals met: 0 of 5
6. (turn_to satellite0 star4 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star4)
   goals met: 0 of 5
7. (calibrate satellite1 instrument3 star4)
   added: (calibrated instrument3)
   goals met: 0 of 5
8. (calibrate satellite0 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 0 of 5
9. (turn_to satellite1 star9 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 star9)
   goals met: 0 of 5
10. (turn_to satellite0 star8 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star8)
   goals met: 0 of 5
11. (take_image satellite1 star9 instrument3 image3)
   added: (have_image star9 image3)
   goals met: 1 of 5
12. (take_image satellite0 star8 instrument1 infrared1)
   added: (have_image star8 infrared1)
   goals met: 2 of 5
13. (turn_to satellite0 phenomenon5 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 phenomenon5)
   goals met: 2 of 5
14. (turn_to satellite1 planet7 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 planet7)
   goals met: 2 of 5
15. (take_image satellite1 planet7 instrument3 spectrograph0)
   added: (have_image planet7 spectrograph0)
   goals met: 3 of 5
16. (take_image satellite0 phenomenon5 instrument1 infrared1)
   added: (have_image phenomenon5 infrared1)
   goals met: 4 of 5
17. (turn_to satellite0 planet6 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 planet6)
   goals met: 4 of 5
18. (turn_to satellite1 planet6 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet6)
   goals met: 4 of 5
19. (take_image satellite0 planet6 instrument1 spectrograph0)
   added: (have_image planet6 spectrograph0)
   goals met: 5 of 5
